<?php

use Illuminate\Database\Seeder;

class CustomFieldsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $names = [["documents","نحوه درخواست",null,'["کتبی ارجاعی","کتبی","کتبی حضوری","تلفنی","سایر"]'],
                  ["documents","نام کارشناس",null,'[""]'],
                  ["documents","حوزه ارجاع",null,'[""]'],
                  ["documents","طبقه بندی",null,'["عادی","محرمانه","خیلی محرمانه","سری","به کلی سری"]'],
                  ["documents","نوع درخواست ارجاع",null,'["جهت استحضار و اقدام لازم","جهت بررسی و اقدام لازم","جهت استحضار و بهره برداری","جهت استحضار و مساعدت","جهت بررسی و اعلام نظر","جهت پاراف\/امضا","جهت ثبت در سوابق","جهت تهیه پاسخ\/و عودت","جهت ملاحظه و عودت"]'],
                  ["documents","محل اشتغال",null,'[""]'],
                  ["documents","نام پدر",null,'[""]'],
                  ["documents","نام و نام خانوادگی",null,'[""]'],
                  ["documents","کد ملی",'max:10','[""]'],
                  ["documents","کد پرسنلی",null,'[""]'],
                  ["documents","شماره نامه ارجاع",null,'[""]'],
                  ["documents","تلفن مستقیم",'numeric|nullable','[""]'],
                  ["documents","تلفن همراه",'numeric|nullable','[""]'],
                  ["documents","اقدامات انجام شده",null,'[""]'],
                  ["documents","سمت سازمانی",null,'["مدیر","رئیس اداره"]'],
                  ["documents","تاریخ نامه ارجاع",null,'[""]'],
                  ["documents","شماره ثبت داخلی دبیرخانه",null,'[""]'],
                  ["documents","تاریخ ثبت داخلی دبیرخانه",null,'[""]'],
                  ["documents","رشته تحصیلی",null,'[""]'],
                  ["documents","نام دانشگاه",null,'[""]'],
                  ["documents","آخرین مقطع تحصیلی",null,'["زیر دیپلم","دیپلم","فوق دیپلم","کارشناسی","کارشناسی ارشد","دکترا","فوق دکتری","سایر"]'],
                  ["documents","واحد محل خدمت",null,'[""]'],
                  ["documents","نوع استخدام",null,'["","قراردادی","رسمی دائم","رسمی آزمایشی","طرح خدمت سربازی","پروژه ای","انجام کار معین","مامور","شرکتی","سایر"]'],
                  ["documents","سنوات خدمت",'nullable','[""]'],
                  ["documents","نام مدیر مستقیم",null,'[""]'],
                  ["documents","حوزه ارجاع دوم",'nullable','[""]'],
                  ["documents","حوزه ارجاع سوم",'nullable','[""]'],
                  ["documents","حوزه ارجاع چهارم",'nullable','[""]'],
                  ["documents","شماره نامه ارجاع دوم",null,'[""]'],
                  ["documents","شماره نامه ارجاع سوم",null,'[""]'],
                  ["documents","شماره نامه ارجاع چهارم",null,'[""]'],
                  ["documents","تاریخ نامه ارجاع دوم",null,'[""]'],
                  ["documents","تاریخ نامه ارجاع سوم",null,'[""]'],
                  ["documents","تاریخ نامه ارجاع چهارم",null,'[""]'],
                  ["documents","شماره ثبت داخلی دبیرخانه دوم",null,'[""]'],
                  ["documents","شماره ثبت داخلی دبیرخانه سوم",null,'[""]'],
                  ["documents","شماره ثبت داخلی دبیرخانه چهارم",null,'[""]'],
                  ["documents","تاریخ ثبت داخلی دبیرخانه دوم",null,'[""]'],
                  ["documents","تاریخ ثبت داخلی دبیرخانه سوم",null,'[""]'],
                  ["documents","تاریخ ثبت داخلی دبیرخانه چهارم",null,'[""]'],
                  ["documents","نوع درخواست ارجاع دوم",null,'["جهت استحضار و اقدام لازم","جهت بررسی و اقدام لازم","جهت استحضار و بهره برداری","جهت استحضار و مساعدت","جهت بررسی و اعلام نظر","جهت پاراف\/امضا","جهت ثبت در سوابق","جهت تهیه پاسخ\/و عودت","جهت ملاحظه و عودت",""]'],
                  ["documents","نوع درخواست ارجاع سوم",null,'["جهت استحضار و اقدام لازم","جهت بررسی و اقدام لازم","جهت استحضار و بهره برداری","جهت استحضار و مساعدت","جهت بررسی و اعلام نظر","جهت پاراف\/امضا","جهت ثبت در سوابق","جهت تهیه پاسخ\/و عودت","جهت ملاحظه و عودت",""]'],
                  ["documents","نوع درخواست ارجاع چهارم",null,'["جهت استحضار و اقدام لازم","جهت بررسی و اقدام لازم","جهت استحضار و بهره برداری","جهت استحضار و مساعدت","جهت بررسی و اعلام نظر","جهت پاراف\/امضا","جهت ثبت در سوابق","جهت تهیه پاسخ\/و عودت","جهت ملاحظه و عودت",""]'],
                  ["documents","نحوه درخواست دوم",null,'["کتبی ارجاعی","کتبی","کتبی حضوری","تلفنی","سایر",""]'],
                  ["documents","نحوه درخواست سوم",null,'["کتبی ارجاعی","کتبی","کتبی حضوری","تلفنی","سایر",""]'],
                  ["documents","نحوه درخواست چهارم",null,'["کتبی ارجاعی","کتبی","کتبی حضوری","تلفنی","سایر",""]'],
                  ["documents","اقدامات انجام شده دوم",null,'[""]'],
                  ["documents","اقدامات انجام شده سوم",null,'[""]'],
                  ["documents","اقدامات انجام شده چهارم",null,'[""]'],
                ];

        foreach ($names as $item) {
            DB::table('custom_fields')->insert([
                'model_type' => $item[0],
                'name' => $item[1],
                'validation' => $item[2],
                'suggestions' => $item[3],
            ]);
        }

    }
}
